Revit 2026 API

# ExportLayerKey Properties

---

The ExportLayerKey type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CategoryName | The category name. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | SpecialType | The special type for layer key. |
|  | SubCategoryName | The subcategrory Name. |

#### Reference

ExportLayerKey Class

Autodesk.Revit.DB Namespace